# StairsPathDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsPathType..::..StairsPathDirection Property
StairsPathType Class See Also
---
The style of the stairs path.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public StairsPathDirection StairsPathDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StairsPathDirection As StairsPathDirection
	Get
```

Visual C++
---
```text
public:
property StairsPathDirection StairsPathDirection {
	StairsPathDirection get ();
}
```

# See Also
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace